<?php

use yii\helpers\Html;
use yii\helpers\Url;
use common\models\Lang;
use yii\widgets\LinkPager;

$lang = Lang::getCurrent()->url;

$title = [
    'rozdilni' => 'Роздільні пандуси',
    'sucilni' => 'Суцільні пандуси',
    'avtomobilni' => 'Автомобільні пандуси',
];

$description = Lang::getCurrent()->url == 'ru'
    ? 'Безопасные и надежные пандусы для людей с инвалидностью. Большой выбор. Наличие на складе. Официальный дилер в Украине BraunAbility (Швеция)'
    : 'Безпечні та надійні пандуси для людей з інвалідністю. Великий вибір. Наявність на складі. Офіційний дилер BraunAbility (Швеція) на території України.';

$this->params['schema'] = \yii\helpers\Json::encode([
    "@context" => "https://schema.org/",
    "@type" => "Thing",
    "name" => Yii::t('main', $title[$type]),
    "url" => \yii\helpers\Url::canonical(),
    "image" => "https://pandus.info/slider_images/pandus4-min.jpg",
    "description" => Yii::t('main', $title[$type]) . ' : ' . $description ?? '',
    "brand" => Yii::t('main', 'Хендікарс ТОВ')/*,
    "aggregateRating" => [
        "@type" => "AggregateRating",
        "ratingValue" => "5",
        "ratingCount" => "56"
    ]*/
]);

$this->registerJsFile("/dist/lib/isotope/dist/isotope.pkgd.js", ['position' => \yii\web\View::POS_END]);

?>

<section class="module pb-0" id="works" style="margin-bottom: 170px">
    <div class="container">
        <div class="row">
            <div class="col-md-6 col-sm-6 col-md-offset-3 col-sm-offset-3">
                <h1 class="module-title font-alt"><?= Yii::t('main', $title[$type]) ?></h1>
                <div class="module-subtitle font-serif"></div>
            </div>
        </div>
        <div class="row" style="margin-bottom: 30px">
            <div class="col-md-12">
                <?php if ($lang == 'ua') { ?>
                    <?php if ($type == 'rozdilni') { ?>
                        <p>Роздільні пандуси використовуються зазвичай для подолання невеликих перешкод людиною на візку
                            або
                            колясці. Має вигляд двох паралельних направляючих, виготовлених з міцного перфорованого
                            алюмінію.
                            Роздільні пандуси забезпечені зручною ручкою для переноски. Переносний пандус зазвичай
                            займає мало
                            місця при зберіганні, транспортуванні в автомобілі або громадському транспорті.</p>
                        <p>Роздільний переносний пандус також може використовуватися для підйому інвалідів у
                            кріслі-колясці в
                            салон автомобіля або іншого транспортного засобу з метою здійснення необхідних поїздок до
                            місця
                            роботи, до місць відпочинку та інше.</p>
                        <p>Роздільні пандуси бувають: <a href="<?= Url::toRoute(['category/category', 'url' => 'telescopic-ramps']) ?>">телескопічні пандуси</a>,
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'foldable-telescopic-ramps']) ?>">телескопічні пандуси, що складаються навпіл</a>,
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'fixed-ramps']) ?>">пандуси фіксованої довжини</a>,
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'tailboard-ramps']) ?>">розкладні пандуси</a>.
                            Бортики на пандусі забезпечують безпеку пересування.</p>
                        <p>Звичайно їх використовують в під‘їздах багатоквартирних будинків, приватних будинках, в інших
                            місцях
                            з обмеженим простором, а також при забезпечені проектів не облаштованих пандусами
                            будівель.</p>
                        <p>Поверхня профілю пандуса не слизька, перфорована або зі спеціально нанесеним покриттям. Це
                            забезпечує
                            додатковий рівень безпеки для пасажира в інвалідному візку.</p>
                    <?php } else if ($type == 'sucilni') { ?>
                        <p>Суцільний пандус відрізняється широкою шаршавою поверхнею. Виготовляється суцільний пандус з
                            алюмінію, завдяки чому забезпечується невелика вага
                            та висока міцність конструкції пандусу. Для зручного використання та транспортування
                            суцільні
                            пандуси складаються впоперек або вздовж.</p>
                        <p>Суцільні пандуси шведського виробництва, наприклад <a href="<?= Url::toRoute(['category/category', 'url' => 'iramps']) ?>">суцільний пандус
                                iRamp</a>, або
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'anyramps']) ?>">пандус суцільний Anyramp</a>,
                            при порівняно невеликій вазі забезпечують навантаження до 400 кг. Таке навантаження пандусу
                            достатньо для пересування як дитячої коляски,
                            так само як інваліда на візку, або скутері, а також на триколісному засобі пересування.</p>
                        <p>Суцільні пандуси <a href="<?= Url::toRoute(['category/country', 'country' => 'Україна']) ?>">українського
                                виробництва</a> мають ручки для транспортування та надійні кронштейни.</p>
                    <?php } else if ($type == 'avtomobilni') { ?>
                        <p>Автомобільні пандуси використовуються для посадки і висадки пасажира на інвалідному візку або
                            дитячій колясці в автомобіль,
                            автобус або інший транспорт.</p>
                        <p>Розрізняють такі типи: <a href="<?= Url::toRoute(['category/category', 'url' => 'two-part-ramps']) ?>">пандуси з двох частин~</a>,
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'three-part-ramps']) ?>">пандус з трьох частин</a>, та
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'commercial-ramps']) ?>">спеціальні</a>
                            автомобільні пандуси
                            для карет швидкої допомоги та інших спеціальних служб.</p>
                        <p>Всі конструкції відрізняються надійним кріпленням пандусу до кузову автомобіля за допомогою
                            спеціальних кронштейнів,
                            швидкі в підготовці до використання, складаються на дві частини або три частини і зручні для
                            транспортування.</p>
                        <p>Автомобільні пандуси дають можливість заїхати на інвалідному візку або дитячій колясці до
                            пасажирського відділення легкового фургону.</p>
                    <?php } ?>
                <?php } else { ?>
                    <?php if ($type == 'rozdilni') { ?>
                        <p>Раздельные пандусы используются обычно для преодоления небольших препятствий человеком на
                            коляске или коляске. Имеет вид двух параллельных направляющих, изготовленных из прочного
                            перфорированного алюминия. Раздельные пандусы снабжены удобной ручкой для переноски.
                            Переносной пандус обычно занимает мало места при хранении, транспортировке в автомобиле или
                            общественном транспорте.
                        </p>
                        <p>Раздельный переносной пандус также может использоваться для подъема инвалидов в
                            кресле-коляске в салон автомобиля или иного транспортного средства с целью осуществления
                            необходимых поездок к месту работы, к местам отдыха и др.
                        </p>
                        <p>Раздельные пандусы бывают: <a href="<?= Url::toRoute(['category/category', 'url' => 'telescopic-ramps']) ?>">телескопические пандусы</a>,
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'foldable-telescopic-ramps']) ?>">телескопические пандусы, состоящие
                                пополам</a>, <a href="<?= Url::toRoute(['category/category', 'url' => 'fixed-ramps']) ?>">пандусы фиксированной длины</a>,
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'tailboard-ramps']) ?>">раскладные пандусы</a>. Бортики на пандусу обеспечивают
                            безопасность передвижения.</p>
                        <p>Обычно их используют в подъездах многоквартирных домов, частных домах, в других местах с
                            ограниченным пространством, а также при обеспечении проектов не оборудованных пандусами
                            зданий.</p>
                        <p>Поверхность профиля пандуса не скользкая, перфорированная или со специально нанесенным
                            покрытием. Это обеспечивает дополнительный уровень безопасности для пассажира в инвалидной
                            коляске.
                        </p>
                    <?php } else if ($type == 'sucilni') { ?>
                        <p>Сплошной пандус отличается широкой шаршавою поверхностью. Изготавливается сплошной пандус из
                            алюминия, благодаря чему обеспечивается небольшой вес и высокая прочность конструкции
                            пандуса. Для удобного использования и транспортировки сплошные пандусы состоят поперек или
                            вдоль.
                        </p>
                        <p>Сплошные пандусы <a href="<?= Url::toRoute(['category/country', 'country' => 'Швеція']) ?>">шведского производства</a>, например
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'iramps']) ?>">сплошной пандус iRamp</a>, или
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'anyramps']) ?>">пандус сплошной Anyramp</a>,
                            при сравнительно небольшом весе обеспечивают нагрузку до 400 кг. Такая
                            нагрузка пандусу достаточно для передвижения как детской коляски, так же как инвалида на
                            коляске, или скутере, а также на трехколесном средстве передвижения.</p>
                        <p>Сплошные пандусы <a href="<?= Url::toRoute(['category/country', 'country' => 'Україна']) ?>">украинского
                                производства</a> имеют ручки для транспортировки и надежные кронштейны.
                        </p>
                    <?php } else if ($type == 'avtomobilni') { ?>
                        <p>Автомобильные пандусы используются для посадки и высадки пассажира на инвалидной коляске или
                            детской коляске в автомобиль, автобус или другой транспорт.</p>
                        <p>Различают следующие типы: <a href="<?= Url::toRoute(['category/category', 'url' => 'two-part-ramps']) ?>">пандусы из двух частей</a>,
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'three-part-ramps']) ?>">пандус из трех частей</a>, и
                            <a href="<?= Url::toRoute(['category/category', 'url' => 'commercial-ramps']) ?>">специальные
                                автомобильные пандусы</a>
                            для карет скорой помощи и других специальных служб.</p>
                        <p>Все конструкции отличаются надежным креплением пандусу к кузову автомобиля при помощи
                            специальных кронштейнов, быстрые в подготовке к использованию, состоят на две части или три
                            части и удобные для транспортировки.
                        </p>
                        <p>Автомобильные пандусы дают возможность заехать на инвалидной коляске или детской коляске до
                            пассажирского отделения легкового фургона.
                        </p>
                    <?php } ?>
                <?php } ?>
            </div>
        </div>
    </div>

    <div class="container">
        <ul class="works-grid works-grid-gut works-grid-3 works-hover-d" id="works-grid">
            <?php foreach ($catalog as $item) { ?>
                <?php if ($item->id == 0) continue ?>
                <li class="work-item <?= $item->class_name ?>">
                    <a href="<?= Url::toRoute(['category/category', 'url' => $item->url]) ?>">
                        <div class="work-image">
                            <img src="/category/<?= $item->image ?>"
                                 alt="<?= $item->{'name_' . $lang} ?>"/></div>
                        <div class="work-caption font-alt">
                            <h3 class="work-title"><?= $item->{'name_' . $lang} ?></h3>
                            <div class="work-descr"><?= Yii::t('main', $item->country_origyn) ?></div>
                        </div>
                    </a>
                </li>
            <?php } ?>
        </ul>
    </div>

</section>
