<?php

use yii\bootstrap\ActiveForm;
use yii\helpers\Html;
use yii\helpers\Url;
use common\models\Lang;
use yii\widgets\MaskedInput;

$lang = Lang::getCurrent()->url;
$route = $lang == 'ua' ? '/ua' : '';

$description = Lang::getCurrent()->url == 'ru'
    ? 'Каталог пандусов. Безопасные и надежные пандусы для людей с инвалидностью. Большой выбор. Наличие на складе. Официальный дилер в Украине BraunAbility (Швеция)'
    : 'Каталог пандусів. Безпечні та надійні пандуси для людей з інвалідністю. Великий вибір. Наявність на складі. Офіційний дилер BraunAbility (Швеція) на території України.';

$this->params['schema'] = \yii\helpers\Json::encode([
    "@context" => "https://schema.org/",
    "@type" => "Product",
    "name" => Yii::t('main', 'Ми доставляємо пандуси по Україні. Можемо доставити пандус у довільне місто'),
    "url" => \yii\helpers\Url::canonical(),
    "image" => "https://pandus.handycars.com.ua/slider_images/pandus4-min.jpg",
    "description" => Yii::t('main', 'Ми доставляємо пандуси по Україні. Можемо доставити пандус у довільне місто'),
    "brand" => Yii::t('main', 'Хендікарс ТОВ'),
    "aggregateRating" => [
        "@type" => "AggregateRating",
        "ratingValue" => "5",
        "ratingCount" => "56",
        "bestRating" => "5"
    ]
]);

$this->registerJsFile("/dist/lib/isotope/dist/isotope.pkgd.js", ['position' => \yii\web\View::POS_END]);

?>

<section class="module bg-dark-60 blog-page-header" data-background="/slider_images/pandus4-min.jpg" style="margin-top: 50px">
    <div class="container">
        <div class="row">
            <div class="col-sm-10 col-md-10 col-md-offset-1 col-sm-offset-1">
                <h1 class="module-title font-alt">
                    <?= Yii::t('main', 'Купити пандус з доставкою по Україні') ?>
                </h1>
                <div class="module-subtitle font-serif">
                    <?= Yii::t('main', '') ?>
                </div>
            </div>
        </div>
    </div>
</section>

<section class="module pb-0" id="services">
    <div class="container">
        <div class="row">
            <div class="col-sm-6 col-sm-offset-3">
                <h2 class="module-title font-alt"><?= Yii::t('main', 'Як купити пандус з доставкою по Україні?') ?></h2>
                <div class="module-subtitle font-serif">
                </div>
            </div>
        </div>
        <div class="row multi-columns-row">
            <div class="col-md-3 col-sm-6 col-xs-12">
                <div class="features-item">
                    <div class="features-icon"><span class="icon-lightbulb"></span></div>
                    <h3 class="features-title font-alt"><?= Yii::t('main', 'Простота') ?></h3>
                    <p><?= Yii::t('main', 'Купити пандуси просто, швидко та безпечно') ?></p>
                </div>
            </div>
            <div class="col-md-3 col-sm-6 col-xs-12">
                <div class="features-item">
                    <div class="features-icon"><span class="icon-genius"></span></div>
                    <h3 class="features-title font-alt"><?= Yii::t('main', 'Гарантія поставки') ?></h3>
                    <p><?= Yii::t('main', 'Наше підприємство вже 5 років успішно поставляє пандуси та інші товари для людей з інвалідністю') ?></p>
                </div>
            </div>
            <div class="col-md-3 col-sm-6 col-xs-12">
                <div class="features-item">
                    <div class="features-icon"><span class="icon-bike"></span></div>
                    <h3 class="features-title font-alt"><?= Yii::t('main', 'Курєрська доставка пандуса протягом доби') ?></h3>
                    <p><?= Yii::t('main', 'Ми доставляємо пандуси по Україні. Можемо доставити пандус у довільне місто') ?></p>
                </div>
            </div>
            <div class="col-md-3 col-sm-6 col-xs-12">
                <div class="features-item">
                    <div class="features-icon"><span class="icon-tools"></span></div>
                    <h3 class="features-title font-alt"><?= Yii::t('main', 'Технічна консультація фахівця') ?></h3>
                    <p><?= Yii::t('main', 'При замовлені пандуса є можливість отримати технічну консультацію фахівця') ?></p>
                </div>
            </div>
        </div>
    </div>
</section>

<section class="module pb-0">
    <div class="<!--pt-4 pb-0-->" id="about">
        <div class="container">
            <div class="row">
                <div class="col-sm-6 col-sm-offset-3">
                    <h2 class="module-title font-alt"><?= Yii::t('main', 'Пандуси') ?></h2>
                    <div class="module-subtitle font-serif"></div>
                </div>

                <div class="col-sm-12">

                    <?php if ($lang == 'ua') { ?>
                        <p>Для людей з обмеженими можливостями, особливо для людини на інвалідному візку, сучасний світ
                            надає безліч перешкод та незручностей у вигляді сходів та навіть бордюрів, не говорячи про
                            посадку в автомобіль. Саме для подолання перешкод та перепон використовується пандус.</p>
                        <p>В сучасному суспільстві людей з обмеженими можливостями досить багато, але нажаль для них не
                            передбачені необхідні зручності. Ці люди також хочуть приймати участь у житті сучасної
                            громади та користуватись соціальними благами як і решта.</p>
                        <p>Пандус - це похила площина між двома різнорівневими поверхнями, що призначена для колісного
                            транспорту (інвалідного візка або дитячої коляски) для підйому і спуску на висоту входу або
                            подолання перешкоди. Наявність такого пандусу дозволять інвалідам та маломобільним
                            громадянам без особливих труднощів відвідувати аптеки, лікарні, школи та інші освітні
                            заклади, ресторани, соціальні служби, адміністративні будівлі та інші організації.</p>
                        <p>Завдяки легкій вазі та зручному виконанню користування пандусом зручно як інвалідам на візку
                            так і супроводжуючим їх особам.</p>
                        <p>Купити пандус можна в <a href="<?= Url::toRoute(['category/index']) ?>">різних варіантах
                                виконання</a>.</p>
                        <p>Для виготовлення пандуса використовують легкий та міцний матеріал високої якості, а саме
                            алюміній. Це є запорукою, що пандус прослужить довго й надійно. Використання такого пандусу
                            має цілу низку переваг:</p>
                        <ul>
                            <li>висока міцність пандуса</li>
                            <li>швидка готовність пандуса до використання</li>
                            <li>обов’язкова наявність бортиків забезпечує безпеку</li>
                            <li>тривалий термін експлуатації пандуса</li>
                            <li>стійкість до впливів вологи та інших зовнішніх чинників</li>
                            <li>простота монтажу й демонтажу</li>
                            <li>доступність у широкому діапазоні варіантів</li>
                            <li>не потребують спеціального догляду та легко очистити від забруднень, не витрачаючи сили
                                й спеціальних засобів
                            </li>
                        </ul>
                        <p>Компанія Хендікарс надає можливість купити пандус
                            <a href="<?= Url::toRoute(['category/country', 'country' => 'Швеція']) ?>">шведського</a> або
                            <a href="<?= Url::toRoute(['category/country', 'country' => 'Україна']) ?>">українського</a>
                            виробництва за
                            прийнятною ціною з алюмінію вибравши необхідний виріб з каталогу з доставкою по Києву та
                            Україні.</p>
                        <p>Як правильно встановити пандус? При встановлені пандусу необхідно розуміти, що кут нахилу для
                            безпечного використання має складати не більше як 11 градусів. Також ширина кожної ланки
                            пандусу має бути не меншою за 15см для безпечного пересування людини з інвалідністю на
                            візку.</p>
                        <p>У нас ви можете купити пандуси таких видів: <a
                                    href="<?= Url::toRoute(['category/types', 'type' => 'rozdilni']) ?>">роздільні
                                пандуси</a>,
                            <a href="<?= Url::toRoute(['category/types', 'type' => 'sucilni']) ?>">суцільні пандуси</a>,
                            <a href="<?= Url::toRoute(['category/types', 'type' => 'avtomobilni']) ?>">автомобільні
                                пандуси</a>.</p>
                    <?php } else { ?>
                        <p>Для людей с ограниченными возможностями, особенно для человека в инвалидной коляске,
                            современный
                            мир
                            предоставляет множество препятствий и неудобств в виде лестницы и даже бордюров, не говоря о
                            посадке
                            в автомобиль. Именно для преодоления препятствий и преград используется пандус.</p>
                        <p>В современном обществе людей с ограниченными возможностями достаточно много, но к сожалению
                            для
                            них не предусмотрены необходимые удобства. Эти люди также хотят участвовать в жизни
                            современного
                            общества и пользоваться социальными благами как и остальные.
                        </p>
                        <p>Пандус - это
                            наклонная плоскость между двумя разноуровневыми поверхностями, предназначена для колесного
                            транспорта (инвалидной коляске или детской коляски) для подъема и спуска на высоту входа или
                            преодоления препятствия. Наличие такого пандуса позволят инвалидам и маломобильным гражданам
                            без
                            особого труда посещать аптеки, больницы, школы и другие образовательные учреждения,
                            рестораны,
                            социальные службы, административные здания и другие организации.</p>
                        <p>Купить пандус можно в <a href="<?= Url::toRoute(['category/index']) ?>">в различных вариантах
                                исполнения.</a>
                        </p>
                        <p>Благодаря легкому весу и удобному выполнению пользования пандусом удобно как инвалидам на
                            коляске
                            так и сопровождающим их лицам.</p>
                        <p>Это является залогом, что пандус прослужит долго и надежно. Использование такого пандуса
                            имеет
                            целый
                            ряд преимуществ:</p>
                        <ul>
                            <li>высокая прочность пандуса</li>
                            <li>быстрая готовность пандуса к использованию</li>
                            <li>обязательно наличие бортиков обеспечивает безопасность</li>
                            <li>длительный срок эксплуатации пандуса</li>
                            <li>устойчивость к воздействиям влаги и других внешних факторов</li>
                            <li>простота монтажа и демонтажа</li>
                            <li>доступность в широком диапазоне вариантов</li>
                            <li>не требуют специального ухода и легко очистить от загрязнений, не тратя силы и
                                специальных средств
                            </li>
                        </ul>
                        <p>Компания Хендикарс предоставляет возможность купить пандус <a
                                    href="<?= Url::toRoute(['category/country', 'country' => 'Швеція']) ?>">шведского</a> или
                            <a href="<?= Url::toRoute(['category/country', 'country' => 'Україна']) ?>">украинского</a> производства по
                            приемлемой цене из алюминия выбрав необходимое изделие из каталога с доставкой по Киеву и
                            Украине.</p>
                        <p>Как правильно установить пандус? При установке пандуса необходимо понимать, что угол наклона
                            для безопасного использования должен составлять не более 11 градусов. Также ширина каждого звена
                            пандуса должна быть не менее 15 см для безопасного передвижения человека с инвалидностью на
                            коляске.</p>
                        <p>У нас вы можете купить пандусы следующих видов: <a
                                    href="<?= Url::toRoute(['category/types', 'type' => 'rozdilni']) ?>">раздельные
                                пандусы</a>,
                            <a href="<?= Url::toRoute(['category/types', 'type' => 'sucilni']) ?>">сплошные пандусы</a>,
                            <a href="<?= Url::toRoute(['category/types', 'type' => 'avtomobilni']) ?>">автомобильные
                                пандусы</a>.</p>
                    <?php } ?>
                </div>
            </div>
        </div>
    </div>
</section>

<?= \frontend\widgets\CatalogWidget::widget() ?>

<?= \frontend\widgets\CitiesWidget::widget() ?>

